brendelj/pops-autonomous-mower/mower-cart-controller/pops_esp32_4wd_mower_drive_controller.ino
/*
==========================================================================================
 POPS' AUTONOMOUS MOWER - MOWER CART DRIVE CONTROLLER                     (revision 3)
==========================================================================================
 REVISION 3 REVIEW / CHANGES
 -----------------------------------------------------------------------------------------
 REVISION 3 ADDS TO THE REVISION 2 SAFETY WORK
   1. Autonomous DRV values outside -1000..+1000 are now REJECTED instead of silently
      clamped. A malformed/corrupted command therefore cannot become a valid full-speed
      command merely because it parsed as a large integer.
   2. Sonar documentation corrected: a JSN-SR04T timeout is inherently ambiguous. It can
      mean open space, a weak/angled target, a target outside range, or (depending on the
      module/target) a target inside the near blind zone. Firmware cannot prove which one.
      The existing post-arming "no echo = open space" policy is retained for outdoor use,
      but it is NOT a complete collision-safety mechanism. A hardware e-stop remains
      required; a bumper/near-field sensor is recommended if close-range coverage matters.
   3. Comments now explicitly warn that the 12-inch stop threshold must be validated at
      the mower's actual maximum speed on grass; MAX_THROTTLE should be reduced until the
      measured stopping distance has adequate margin.

 REVISION 2 CHANGES
 -----------------------------------------------------------------------------------------
 FIRMWARE
   1. RC timeout race fixed: pulse widths AND their timestamps are snapshotted together
      with interrupts off, so a pulse landing mid-check can no longer cause a false stop.
   2. Ultrasonic logic rewritten around four outcomes:
        VALID      echo between 20 cm and 600 cm
        TOO CLOSE  echo under 20 cm (blind zone) -> that direction is BLOCKED IMMEDIATELY
        NO ECHO    nothing within ~5 m. Once a sensor has been ARMED by one valid echo
                   since power-up, no echo means "clear". Until armed it stays BLOCKED.
                   Set SONAR_NO_ECHO_IS_CLEAR=false to restore the strict first-version
                   behavior (no echo = fault) - expect lockouts in open ground.
        STUCK      ECHO already HIGH before a trigger -> counts toward a sensor fault
      To arm a sensor after power-up, put a hand or board 50-100 cm in front of it.
   3. Serial2 reports fixed: SENSOR_FAULT never carries a distance, and a fault-caused
      block no longer emits OBS with a stale distance (could map a phantom obstacle).
   4. Serial2 parser is strict: numbers validated, extra fields rejected, optional XOR
      checksum, and an oversized line is discarded up to its newline.
   5. Throttle/steering slew limiting. Obstacle-interlock cuts are never ramped.
   6. RC sticks must return to neutral after boot, mode change, or RC signal loss before
      the cart will move. AUTO ignores any DRV received before the mode switch.
   7. RC/AUTO selector is debounced.
   8. MAX_THROTTLE speed cap, and a 1 second task watchdog.
   9. 1 Hz status line on USB serial (115200) for bench testing.

 HARDWARE ADDITIONS (not in the first version - please add)
   - FlySky CH1/CH2 into GPIO34/35: if the receiver runs from 5V its signal is ~5V.
     Use the same divider as the JSN echo lines: signal -1K- GPIO, GPIO -2K- GND.
   - 10K pull-down from GPIO13 to GND so the BTS7960 enables stay off during reset/boot.
   - Hardware e-stop / contactor in the +12V motor bus that does not depend on firmware.
   - Set the receiver failsafe (throttle neutral) and TEST it with the transmitter off.
   - Bulk capacitor (470 uF or more) near the 5V buck output.

==========================================================================================
 BOARD / HARDWARE
 -----------------------------------------------------------------------------------------
 Maker / kit: AITRIP
 Product:     ESP-WROOM-32 ESP32 / ESP-32S Type-C USB Development Board
 USB-UART:    CH340C
 Module:      ESP-WROOM-32
 Board type:  30-pin ESP32 development board (15 pins per side)
 USB:         Type-C

 Viewed from ABOVE, component side up, Type-C connector at the BOTTOM.
 EVERY physical header pin is shown.

                                  ANTENNA
                            .-----------------.
                            |   ESP-WROOM-32  |
                            |                 |
 UNUSED                EN  | o             o | D23 / GPIO23  <--- RC/AUTO SWITCH
 UNUSED        VP / GPIO36 | o             o | D22 / GPIO22  <--- FRONT JSN ECHO *
 UNUSED        VN / GPIO39 | o             o | TX0 / GPIO1        USB SERIAL TX
 FlySky CH1 STEERING --->34| o             o | RX0 / GPIO3        USB SERIAL RX
 FlySky CH2 THROTTLE --->35| o             o | D21 / GPIO21  ---> FRONT JSN TRIG
 REAR LEFT RPWM       <---32| o             o | D19 / GPIO19  ---> REAR RIGHT LPWM
 REAR LEFT LPWM       <---33| o             o | D18 / GPIO18  ---> REAR RIGHT RPWM
 FRONT LEFT RPWM      <---25| o             o | D5  / GPIO5   <--- REAR JSN ECHO *
 FRONT LEFT LPWM      <---26| o             o | D17 / GPIO17  ---> AUTO ESP32 RX (TX2)
 FRONT RIGHT RPWM     <---27| o             o | D16 / GPIO16  <--- AUTO ESP32 TX (RX2)
 FRONT RIGHT LPWM     <---14| o             o | D4  / GPIO4   ---> REAR JSN TRIG
 UNUSED / STRAP          12| o             o | D2  / GPIO2        UNUSED / STRAP
 BTS7960 ENABLE       <---13| o             o | D15 / GPIO15       UNUSED / STRAP
 COMMON GROUND          GND| o             o | GND                COMMON GROUND
 +5V BUCK ------------> VIN| o             o | 3V3                UNUSED
                            |                 |
                            |     TYPE-C      |
                            '-------| |-------'

 * JSN-SR04T ECHO is 5V. DO NOT connect ECHO directly to ESP32.
   Use a 5V -> 3.3V divider/level shifter on GPIO22 and GPIO5.

 PHYSICAL HEADER ORDER (TOP -> BOTTOM)
 -----------------------------------------------------------------------------------------
 LEFT SIDE                               RIGHT SIDE
 EN        UNUSED                        GPIO23   RC/AUTO SWITCH
 GPIO36    UNUSED                        GPIO22   FRONT JSN-SR04T ECHO *
 GPIO39    UNUSED                        GPIO1    USB SERIAL TX
 GPIO34    FLYSKY CH1 STEERING           GPIO3    USB SERIAL RX
 GPIO35    FLYSKY CH2 THROTTLE           GPIO21   FRONT JSN-SR04T TRIG
 GPIO32    REAR LEFT RPWM                GPIO19   REAR RIGHT LPWM
 GPIO33    REAR LEFT LPWM                GPIO18   REAR RIGHT RPWM
 GPIO25    FRONT LEFT RPWM               GPIO5    REAR JSN-SR04T ECHO *
 GPIO26    FRONT LEFT LPWM               GPIO17   AUTO ESP32 RX
 GPIO27    FRONT RIGHT RPWM              GPIO16   AUTO ESP32 TX
 GPIO14    FRONT RIGHT LPWM              GPIO4    REAR JSN-SR04T TRIG
 GPIO12    UNUSED / STRAP                GPIO2    UNUSED / STRAP
 GPIO13    ALL BTS7960 ENABLES           GPIO15   UNUSED / STRAP
 GND       COMMON GROUND                 GND      COMMON GROUND
 VIN       +5V FROM BUCK                 3V3      UNUSED

