brendelj/pops-autonomous-mower/mower-cart-controller/pops_esp32_4wd_mower_drive_controller.ino
==========================================================================================
 LOCKED GPIO ASSIGNMENTS - SOURCE OF TRUTH
==========================================================================================
 RC INPUT
   GPIO34 <- FlySky CH1 steering
   GPIO35 <- FlySky CH2 throttle

 RC / AUTONOMOUS SELECTOR
   GPIO23 <- selector switch using INPUT_PULLUP
             OPEN          = RC MODE
             CLOSED -> GND = AUTONOMOUS MODE

 AUTONOMOUS ESP32 UART
   GPIO16 RX2 <- Autonomous ESP32 TX
   GPIO17 TX2 -> Autonomous ESP32 RX

 FRONT JSN-SR04T
   GPIO21 -> TRIG
   GPIO22 <- ECHO through 5V -> 3.3V level conversion
   VCC    -> regulated +5V
   GND    -> common ground

 REAR JSN-SR04T
   GPIO4  -> TRIG
   GPIO5  <- ECHO through 5V -> 3.3V level conversion
   VCC    -> regulated +5V
   GND    -> common ground

 FOUR BTS7960 MOTOR CONTROLLERS
   FRONT LEFT    GPIO25 RPWM    GPIO26 LPWM
   FRONT RIGHT   GPIO27 RPWM    GPIO14 LPWM
   REAR LEFT     GPIO32 RPWM    GPIO33 LPWM
   REAR RIGHT    GPIO18 RPWM    GPIO19 LPWM

   GPIO13 -> R_EN and L_EN on ALL FOUR BTS7960 boards

 BTS7960 PHYSICAL CONNECTIONS - MODULE ORIENTATION FROM POPS' REFERENCE PHOTO
   Pin 1  RPWM  <- motor-specific RPWM GPIO
   Pin 2  LPWM  <- motor-specific LPWM GPIO
   Pin 3  R_EN  <- GPIO13 shared enable
   Pin 4  L_EN  <- GPIO13 shared enable
   Pin 5  R_IS  -- not used
   Pin 6  L_IS  -- not used
   Pin 7  VCC   <- regulated +5V logic
   Pin 8  GND   <- common ground
   Pin 9  MOTOR -
   Pin 10 MOTOR +
   Pin 11 VM+   <- fused/switched +12V motor bus
   Pin 12 VM-   <- battery negative/common ground

 JSN-SR04T ECHO LEVEL CONVERSION - EACH SENSOR
   JSN ECHO (5V) -- 1K --+--> ESP32 ECHO GPIO
                          |
                          2K
                          |
                         GND
   Front midpoint -> GPIO22
   Rear midpoint  -> GPIO5

 OBSTACLE SAFETY
   STOP/BLOCK distance = 12.0 in / 30.48 cm
   CLEAR distance      = 15.0 in / 38.10 cm (hysteresis)
   Front obstruction blocks positive/forward throttle.
   Rear obstruction blocks negative/reverse throttle.
   Steering remains available so RC operator/autonomous controller can turn away.
   Motion in the opposite direction remains available.
   Sensors start fail-safe BLOCKED until a valid reading proves clearance (arming).
   A returned echo measured inside the configured blind-zone limit blocks immediately.
   IMPORTANT: a NO-ECHO timeout cannot distinguish open space from every possible near-field
   failure/target condition. Do not treat these two sonars as the mower's only collision
   protection. A physical bumper/near-field backup sensor is recommended.
   A blocked direction is only cleared by a valid reading at or beyond the CLEAR distance;
   "no echo" never clears a blocked direction.
   Steering is not covered: the sensors watch straight ahead/behind only, so a pivot can
   still swing the ends of the cart into something.

 AUTONOMOUS OBSTACLE REPORTS ON Serial2
   OBS,FRONT,<millimeters>
   OBS,REAR,<millimeters>
   CLEAR,FRONT,<millimeters>
   CLEAR,REAR,<millimeters>
   SENSOR_FAULT,FRONT
   SENSOR_FAULT,REAR

   The cart controller also retains a small recent detection history in RAM.
   A geometric/global obstacle outline requires mower position/heading, so the
   autonomous ESP32 must combine these reports with its navigation pose and store
   the mapped obstacle boundary there.

 POWER
   12V battery -> fuse -> master switch -> +12V motor distribution -> BTS7960 VM+
   12V battery -> regulated 5V buck -> ESP32 VIN, JSN-SR04T VCC, BTS7960 VCC
   Verify FlySky receiver supply voltage before connecting its VCC.
   ALL controller, receiver, sensor, motor-driver and autonomous ESP32 grounds
   must share a common reference.

 WHEEL CALIBRATION
   Front wheel diameter = 11.50 inches
   Rear wheel diameter  = 12.25 inches
   Front wheel scale    = 12.25 / 11.50 = 1.065217

 AUTONOMOUS SERIAL COMMANDS (from the autonomous ESP32, 115200 8N1, newline terminated)
   DRV,<throttle>,<steering>[*HH]   (-1000 through +1000)
   STOP[*HH]
   *HH is an optional two-digit hex XOR of every character before the '*'.
   Examples:  DRV,500,-200*6A     STOP*18     DRV,0,0*40
   Sender (autonomous ESP32):
      String body="DRV,500,-200"; uint8_t c=0; for(char ch:body) c^=(uint8_t)ch;
      char hh[4]; snprintf(hh,sizeof(hh),"%02X",c); Serial2.println(body+"*"+hh);
   Set AUTO_REQUIRE_CHECKSUM=true below to reject DRV lines without a checksum.
   STOP is always accepted, with or without a checksum, because it is the safe direction.
   The autonomous controller must keep sending DRV at least every 300 ms.

 FAILSAFE
   RC signal timeout stops all motors and requires the sticks to return to neutral.
   Autonomous command timeout stops all motors.
   Changing RC/AUTO mode forces a temporary stop and discards old autonomous commands.
   Ultrasonic direction interlock is applied AFTER either RC or autonomous command,
   and after the ramp, so a cut is immediate.
   A hung main loop resets the ESP32 after WDT_TIMEOUT_S (motor pins go inactive).
==========================================================================================
*/
#include <Arduino.h>
#include <esp_task_wdt.h>
#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
#define CORE_V3 1
#else
#define CORE_V3 0
#endif

const uint8_t PIN_RC_STEERING=34, PIN_RC_THROTTLE=35, PIN_AUTO_SWITCH=23;
const uint8_t PIN_AUTO_RX=16, PIN_AUTO_TX=17;
const uint8_t PIN_FL_RPWM=25, PIN_FL_LPWM=26;
const uint8_t PIN_FR_RPWM=27, PIN_FR_LPWM=14;
const uint8_t PIN_RL_RPWM=32, PIN_RL_LPWM=33;
const uint8_t PIN_RR_RPWM=18, PIN_RR_LPWM=19;
const uint8_t PIN_MOTOR_ENABLE=13;
const uint8_t PIN_FRONT_TRIG=21, PIN_FRONT_ECHO=22;
const uint8_t PIN_REAR_TRIG=4, PIN_REAR_ECHO=5;

const float FRONT_WHEEL_DIAMETER=11.50f, REAR_WHEEL_DIAMETER=12.25f;
const float FRONT_WHEEL_SCALE=REAR_WHEEL_DIAMETER/FRONT_WHEEL_DIAMETER;
float FL_TRIM=1.000f, FR_TRIM=1.000f, RL_TRIM=1.000f, RR_TRIM=1.000f;
bool FL_REVERSED=false, FR_REVERSED=true, RL_REVERSED=false, RR_REVERSED=true;

int RC_STEER_LEFT_US=1000, RC_STEER_CENTER_US=1500, RC_STEER_RIGHT_US=2000;
int RC_THROTTLE_REV_US=1000, RC_THROTTLE_NEUTRAL_US=1500, RC_THROTTLE_FWD_US=2000;
const int RC_STEER_DEADBAND_US=25, RC_THROTTLE_DEADBAND_US=35;

const uint32_t RC_TIMEOUT_MS=150, AUTO_TIMEOUT_MS=300, MODE_CHANGE_STOP_MS=300;
const uint32_t RC_NEUTRAL_HOLD_MS=300;
const uint32_t SWITCH_DEBOUNCE_MS=50;
const uint32_t STATUS_INTERVAL_MS=1000;
const uint32_t WDT_TIMEOUT_S=1;
const uint32_t PWM_FREQ=16000; const uint8_t PWM_BITS=10;
const uint16_t PWM_MAX=(1<<PWM_BITS)-1;

const float MAX_THROTTLE=1.0f;
const float RAMP_ACCEL_PER_SEC=2.0f;
const float RAMP_DECEL_PER_SEC=6.0f;

