brendelj/pops-autonomous-mower/mower-cart-controller/pops_esp32_4wd_mower_drive_controller.ino
const bool AUTO_REQUIRE_CHECKSUM=false;

const float OBSTACLE_STOP_CM=30.48f;
const float OBSTACLE_CLEAR_CM=38.10f;
const float SONAR_MIN_VALID_CM=20.0f;
const float SONAR_MAX_VALID_CM=600.0f;
const uint32_t SONAR_SAMPLE_INTERVAL_MS=70;
const uint32_t SONAR_ECHO_TIMEOUT_US=30000;
const uint8_t SONAR_FAULT_LIMIT=3;
const bool SONAR_NO_ECHO_IS_CLEAR=true;

enum SonarResult : uint8_t { SONAR_OK, SONAR_TOO_CLOSE, SONAR_NO_ECHO, SONAR_STUCK };

struct SonarState {
  uint8_t trigPin; uint8_t echoPin; const char* name; float distanceCm;
  bool blocked; bool fault; bool armed; uint8_t invalidCount; uint32_t lastRememberMs;
};

SonarState frontSonar={PIN_FRONT_TRIG,PIN_FRONT_ECHO,"FRONT",-1.0f,true,false,false,0,0};
SonarState rearSonar ={PIN_REAR_TRIG,PIN_REAR_ECHO,"REAR",-1.0f,true,false,false,0,0};
uint32_t lastSonarSampleMs=0; bool sampleFrontNext=true;

struct ObstacleObservation { uint32_t timeMs; bool front; uint16_t distanceMm; };
const uint8_t OBSTACLE_HISTORY_SIZE=32;
ObstacleObservation obstacleHistory[OBSTACLE_HISTORY_SIZE];
uint8_t obstacleHistoryHead=0, obstacleHistoryCount=0;

volatile uint32_t steeringRiseUs=0, throttleRiseUs=0;
volatile uint16_t steeringPulseUs=1500, throttlePulseUs=1500;
volatile uint32_t steeringLastPulseMs=0, throttleLastPulseMs=0;
float autoThrottle=0.0f, autoSteering=0.0f;
bool autoCommandValid=false;
uint32_t lastAutoCommandMs=0, modeChangeMs=0;
String autoBuffer; bool autoDiscard=false;
bool previousAutoMode=false;
bool switchStable=false, switchCandidate=false; uint32_t switchCandidateMs=0;
bool rcArmed=false, rcNeutralTiming=false; uint32_t rcNeutralStartMs=0;
float rampThrottle=0.0f, rampSteering=0.0f; uint32_t lastRampMs=0;
uint32_t lastStatusMs=0;

#if CORE_V3
void configurePwmPin(uint8_t pin){ ledcAttach(pin,PWM_FREQ,PWM_BITS); }
void writePwm(uint8_t pin,uint16_t duty){ ledcWrite(pin,duty); }
#else
struct PwmMapEntry{uint8_t pin;uint8_t channel;}; PwmMapEntry pwmMap[8];
uint8_t pwmMapCount=0,pwmChannelCounter=0;
void configurePwmPin(uint8_t pin){uint8_t ch=pwmChannelCounter++;ledcSetup(ch,PWM_FREQ,PWM_BITS);ledcAttachPin(pin,ch);pwmMap[pwmMapCount++]={pin,ch};}
void writePwm(uint8_t pin,uint16_t duty){for(uint8_t i=0;i<pwmMapCount;i++)if(pwmMap[i].pin==pin){ledcWrite(pwmMap[i].channel,duty);return;}}
#endif

void IRAM_ATTR steeringISR(){if(digitalRead(PIN_RC_STEERING))steeringRiseUs=micros();else{uint32_t w=micros()-steeringRiseUs;if(w>=800&&w<=2200){steeringPulseUs=w;steeringLastPulseMs=millis();}}}
void IRAM_ATTR throttleISR(){if(digitalRead(PIN_RC_THROTTLE))throttleRiseUs=micros();else{uint32_t w=micros()-throttleRiseUs;if(w>=800&&w<=2200){throttlePulseUs=w;throttleLastPulseMs=millis();}}}

float convertCenteredRc(int p,int mn,int ctr,int mx,int db){
 if(abs(p-ctr)<=db)return 0.0f;
 float v=(p>ctr)?(float)(p-ctr)/(mx-ctr):(float)(p-ctr)/(ctr-mn);
 return constrain(v,-1.0f,1.0f);
}

void stopMotor(uint8_t r,uint8_t l){writePwm(r,0);writePwm(l,0);}
void setMotor(uint8_t r,uint8_t l,float c,bool rev){
 c=constrain(c,-1.0f,1.0f); if(rev)c=-c; uint16_t d=(uint16_t)(fabs(c)*PWM_MAX);
 if(c>0.001f){writePwm(l,0);writePwm(r,d);}else if(c<-0.001f){writePwm(r,0);writePwm(l,d);}else stopMotor(r,l);
}
void stopAllMotors(){stopMotor(PIN_FL_RPWM,PIN_FL_LPWM);stopMotor(PIN_FR_RPWM,PIN_FR_LPWM);stopMotor(PIN_RL_RPWM,PIN_RL_LPWM);stopMotor(PIN_RR_RPWM,PIN_RR_LPWM);}
void haltAll(){stopAllMotors();rampThrottle=0.0f;rampSteering=0.0f;lastRampMs=millis();}

void normalizeWheelCommands(float&fl,float&fr,float&rl,float&rr){
 float m=max(max(fabs(fl),fabs(fr)),max(fabs(rl),fabs(rr)));
 if(m>1.0f){fl/=m;fr/=m;rl/=m;rr/=m;}
}
void driveMower(float throttle,float steering){
 float left=throttle+steering,right=throttle-steering,m=max(fabs(left),fabs(right));
 if(m>1.0f){left/=m;right/=m;}
 float fl=left*FRONT_WHEEL_SCALE*FL_TRIM,fr=right*FRONT_WHEEL_SCALE*FR_TRIM;
 float rl=left*RL_TRIM,rr=right*RR_TRIM; normalizeWheelCommands(fl,fr,rl,rr);
 setMotor(PIN_FL_RPWM,PIN_FL_LPWM,fl,FL_REVERSED);setMotor(PIN_FR_RPWM,PIN_FR_LPWM,fr,FR_REVERSED);
 setMotor(PIN_RL_RPWM,PIN_RL_LPWM,rl,RL_REVERSED);setMotor(PIN_RR_RPWM,PIN_RR_LPWM,rr,RR_REVERSED);
}

void rememberObstacle(bool front,float cm){
 ObstacleObservation &o=obstacleHistory[obstacleHistoryHead]; o.timeMs=millis();o.front=front;
 float mm=cm*10.0f;if(mm<0)mm=0;if(mm>65535)mm=65535;o.distanceMm=(uint16_t)mm;
 obstacleHistoryHead=(obstacleHistoryHead+1)%OBSTACLE_HISTORY_SIZE;
 if(obstacleHistoryCount<OBSTACLE_HISTORY_SIZE)obstacleHistoryCount++;
}
void reportSonarEvent(const char* eventName,const SonarState& s,bool withDistance,float cm){
 Serial2.print(eventName);Serial2.print(',');Serial2.print(s.name);
 if(withDistance){Serial2.print(',');Serial2.print((int)(cm*10.0f));}Serial2.println();
}
SonarResult readJsnSr04t(const SonarState& s,float& cm){
 if(digitalRead(s.echoPin)==HIGH)return SONAR_STUCK;
 digitalWrite(s.trigPin,LOW);delayMicroseconds(3);digitalWrite(s.trigPin,HIGH);delayMicroseconds(12);digitalWrite(s.trigPin,LOW);
 unsigned long echoUs=pulseIn(s.echoPin,HIGH,SONAR_ECHO_TIMEOUT_US);
 if(echoUs==0)return SONAR_NO_ECHO;
 cm=(echoUs*0.0343f)/2.0f;
 if(cm<SONAR_MIN_VALID_CM)return SONAR_TOO_CLOSE;
 if(cm>SONAR_MAX_VALID_CM)return SONAR_NO_ECHO;
 return SONAR_OK;
}
void updateOneSonar(SonarState& s,bool isFront){
 const bool wasBlocked=s.blocked,wasFault=s.fault;float cm=-1.0f;
 const SonarResult r=readJsnSr04t(s,cm);bool haveDistance=false,invalid=false;
 switch(r){
  case SONAR_OK:
   s.invalidCount=0;s.fault=false;s.armed=true;s.distanceCm=cm;haveDistance=true;
   if(s.blocked){if(cm>=OBSTACLE_CLEAR_CM)s.blocked=false;}else if(cm<=OBSTACLE_STOP_CM)s.blocked=true;break;
  case SONAR_TOO_CLOSE:
   s.invalidCount=0;s.fault=false;s.armed=true;s.distanceCm=cm;haveDistance=true;s.blocked=true;break;
  case SONAR_NO_ECHO:
   if(SONAR_NO_ECHO_IS_CLEAR&&s.armed){s.invalidCount=0;s.fault=false;s.distanceCm=-1.0f;}else invalid=true;break;
  case SONAR_STUCK: invalid=true;break;
 }
 if(invalid){if(s.invalidCount<255)s.invalidCount++;if(s.invalidCount>=SONAR_FAULT_LIMIT){s.fault=true;s.blocked=true;}}
 if(!wasFault&&s.fault)reportSonarEvent("SENSOR_FAULT",s,false,0.0f);
 if(wasBlocked!=s.blocked){
  if(s.blocked){if(haveDistance){rememberObstacle(isFront,s.distanceCm);reportSonarEvent("OBS",s,true,s.distanceCm);}}
  else reportSonarEvent("CLEAR",s,true,s.distanceCm);
 }else if(s.blocked&&haveDistance){
  if(wasFault&&!s.fault){rememberObstacle(isFront,s.distanceCm);reportSonarEvent("OBS",s,true,s.distanceCm);s.lastRememberMs=millis();}
  else if(millis()-s.lastRememberMs>=500){rememberObstacle(isFront,s.distanceCm);s.lastRememberMs=millis();}
 }
}
void updateSonars(){
 uint32_t now=millis();if(now-lastSonarSampleMs<SONAR_SAMPLE_INTERVAL_MS)return;lastSonarSampleMs=now;
 if(sampleFrontNext)updateOneSonar(frontSonar,true);else updateOneSonar(rearSonar,false);sampleFrontNext=!sampleFrontNext;
}
bool applyObstacleInterlock(float& throttle,float& steering){
 bool cut=false;if(throttle>0.0f&&frontSonar.blocked){throttle=0.0f;cut=true;}
 if(throttle<0.0f&&rearSonar.blocked){throttle=0.0f;cut=true;}steering=constrain(steering,-1.0f,1.0f);return cut;
}

float slewLimit(float cur,float target,float dt){
 float delta=target-cur;const bool slowingDown=(fabsf(target)<fabsf(cur))&&(cur*target>=0.0f);
 const float maxStep=(slowingDown?RAMP_DECEL_PER_SEC:RAMP_ACCEL_PER_SEC)*dt;
 if(delta>maxStep)delta=maxStep;else if(delta<-maxStep)delta=-maxStep;return cur+delta;
}
void driveWithRamp(float targetThrottle,float targetSteering){
 uint32_t now=millis();float dt=(now-lastRampMs)/1000.0f;lastRampMs=now;if(dt>0.1f)dt=0.1f;
 targetThrottle=constrain(targetThrottle,-1.0f,1.0f)*MAX_THROTTLE;targetSteering=constrain(targetSteering,-1.0f,1.0f);
 rampThrottle=slewLimit(rampThrottle,targetThrottle,dt);rampSteering=slewLimit(rampSteering,targetSteering,dt);
 float t=rampThrottle,s=rampSteering;applyObstacleInterlock(t,s);rampThrottle=t;driveMower(t,s);
}

void autoStopCommand(){autoThrottle=0.0f;autoSteering=0.0f;autoCommandValid=true;lastAutoCommandMs=millis();}
bool parseIntStrict(const String& t,int& out){
 int n=t.length();if(n<=0||n>6)return false;int i=(t[0]=='-'||t[0]=='+')?1:0;if(i>=n)return false;
 for(;i<n;i++)if(t[i]<'0'||t[i]>'9')return false;out=t.toInt();return true;
}
bool stripChecksum(String& s){
 int star=s.lastIndexOf('*');if(star<0)return !AUTO_REQUIRE_CHECKSUM;if((int)s.length()-star!=3)return false;
 uint8_t calc=0;for(int i=0;i<star;i++)calc^=(uint8_t)s[i];String hex=s.substring(star+1);
 char* endp=nullptr;long given=strtol(hex.c_str(),&endp,16);if(endp==hex.c_str()||*endp!='\0')return false;
 if(calc!=(uint8_t)given)return false;s.remove(star);return true;
}
void processAutoCommand(String s){
 s.trim();if(s.equalsIgnoreCase("STOP")){autoStopCommand();return;}if(!stripChecksum(s))return;
 if(s.equalsIgnoreCase("STOP")){autoStopCommand();return;}if(!s.startsWith("DRV,"))return;
 int c1=s.indexOf(','),c2=s.indexOf(',',c1+1);if(c1<0||c2<0)return;int t,st;
 if(!parseIntStrict(s.substring(c1+1,c2),t)||!parseIntStrict(s.substring(c2+1),st))return;
 if(t < -1000 || t > 1000 || st < -1000 || st > 1000)return;
 autoThrottle=t/1000.0f;autoSteering=st/1000.0f;autoCommandValid=true;lastAutoCommandMs=millis();
}
void readAutoSerial(){
 while(Serial2.available()){char c=Serial2.read();if(c=='\n'){if(autoDiscard)autoDiscard=false;else processAutoCommand(autoBuffer);autoBuffer="";}
 else if(c!='\r'){if(autoDiscard){}else if(autoBuffer.length()<80)autoBuffer+=c;else{autoBuffer="";autoDiscard=true;}}}
}

bool readAutoSwitch(){
 bool raw=(digitalRead(PIN_AUTO_SWITCH)==LOW);uint32_t now=millis();
 if(raw!=switchCandidate){switchCandidate=raw;switchCandidateMs=now;}
 else if(raw!=switchStable&&now-switchCandidateMs>=SWITCH_DEBOUNCE_MS)switchStable=raw;return switchStable;
}
const char* sonarText(const SonarState& s){return s.fault?"FAULT":(s.blocked?"BLOCK":"clear");}
void printStatus(bool autoMode){
 uint32_t now=millis();if(now-lastStatusMs<STATUS_INTERVAL_MS)return;lastStatusMs=now;
 Serial.printf("mode=%s ramp=%+.2f/%+.2f rcArmed=%d front=%s(%.0fcm,%s) rear=%s(%.0fcm,%s)\n",
 autoMode?"AUTO":"RC",rampThrottle,rampSteering,rcArmed?1:0,
 sonarText(frontSonar),frontSonar.distanceCm,frontSonar.armed?"armed":"UNARMED",
 sonarText(rearSonar),rearSonar.distanceCm,rearSonar.armed?"armed":"UNARMED");
}

