brendelj/pops-autonomous-mower/mower-cart-controller/pops_esp32_4wd_mower_drive_controller.ino
void setup(){
 Serial.begin(115200);Serial2.begin(115200,SERIAL_8N1,PIN_AUTO_RX,PIN_AUTO_TX);
 pinMode(PIN_MOTOR_ENABLE,OUTPUT);digitalWrite(PIN_MOTOR_ENABLE,LOW);
 pinMode(PIN_RC_STEERING,INPUT);pinMode(PIN_RC_THROTTLE,INPUT);pinMode(PIN_AUTO_SWITCH,INPUT_PULLUP);
 pinMode(PIN_FRONT_TRIG,OUTPUT);pinMode(PIN_FRONT_ECHO,INPUT);pinMode(PIN_REAR_TRIG,OUTPUT);pinMode(PIN_REAR_ECHO,INPUT);
 digitalWrite(PIN_FRONT_TRIG,LOW);digitalWrite(PIN_REAR_TRIG,LOW);
 const uint8_t pins[]={PIN_FL_RPWM,PIN_FL_LPWM,PIN_FR_RPWM,PIN_FR_LPWM,PIN_RL_RPWM,PIN_RL_LPWM,PIN_RR_RPWM,PIN_RR_LPWM};
 for(uint8_t p:pins)configurePwmPin(p);haltAll();
 attachInterrupt(digitalPinToInterrupt(PIN_RC_STEERING),steeringISR,CHANGE);
 attachInterrupt(digitalPinToInterrupt(PIN_RC_THROTTLE),throttleISR,CHANGE);
 for(uint8_t i=0;i<6;i++){updateSonars();delay(75);}
 switchStable=switchCandidate=(digitalRead(PIN_AUTO_SWITCH)==LOW);switchCandidateMs=millis();
 previousAutoMode=switchStable;modeChangeMs=millis();autoCommandValid=false;rcArmed=false;rcNeutralTiming=false;
 delay(500);digitalWrite(PIN_MOTOR_ENABLE,HIGH);
#if CORE_V3
 esp_task_wdt_config_t wdtCfg={};wdtCfg.timeout_ms=WDT_TIMEOUT_S*1000;wdtCfg.idle_core_mask=0;wdtCfg.trigger_panic=true;
 esp_task_wdt_reconfigure(&wdtCfg);
#else
 esp_task_wdt_init(WDT_TIMEOUT_S,true);
#endif
 esp_task_wdt_add(NULL);
}

void loop(){
 esp_task_wdt_reset();readAutoSerial();updateSonars();
 const bool autoMode=readAutoSwitch();
 if(autoMode!=previousAutoMode){
  haltAll();modeChangeMs=millis();previousAutoMode=autoMode;autoThrottle=autoSteering=0.0f;autoCommandValid=false;
  rcArmed=false;rcNeutralTiming=false;
 }
 printStatus(autoMode);if(millis()-modeChangeMs<MODE_CHANGE_STOP_MS){haltAll();delay(5);return;}
 if(autoMode){
  if(!autoCommandValid||millis()-lastAutoCommandMs>AUTO_TIMEOUT_MS){haltAll();delay(5);return;}
  driveWithRamp(autoThrottle,autoSteering);
 }else{
  uint16_t sp,tp;uint32_t sLast,tLast;noInterrupts();
  sp=steeringPulseUs;tp=throttlePulseUs;sLast=steeringLastPulseMs;tLast=throttleLastPulseMs;interrupts();
  uint32_t now=millis();
  if(now-sLast>=RC_TIMEOUT_MS||now-tLast>=RC_TIMEOUT_MS){haltAll();rcArmed=false;rcNeutralTiming=false;delay(5);return;}
  float s=convertCenteredRc(sp,RC_STEER_LEFT_US,RC_STEER_CENTER_US,RC_STEER_RIGHT_US,RC_STEER_DEADBAND_US);
  float t=convertCenteredRc(tp,RC_THROTTLE_REV_US,RC_THROTTLE_NEUTRAL_US,RC_THROTTLE_FWD_US,RC_THROTTLE_DEADBAND_US);
  if(!rcArmed){
   if(t==0.0f&&s==0.0f){if(!rcNeutralTiming){rcNeutralTiming=true;rcNeutralStartMs=now;}else if(now-rcNeutralStartMs>=RC_NEUTRAL_HOLD_MS)rcArmed=true;}
   else rcNeutralTiming=false;if(!rcArmed){haltAll();delay(5);return;}
  }
  driveWithRamp(t,s);
 }
 delay(5);
}
